       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAM2.
       AUTHOR. GROUP4.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT GSYSTEM-OUT ASSIGN TO "GSYS-OUT.DAT"
               ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD  GSYSTEM-OUT
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS PRINT-REC.
       01  PRINT-REC PIC X(250).

       WORKING-STORAGE SECTION.
       01  HEADER1.
           02 FILLER PIC X(50) VALUE SPACES.
           02 FILLER PIC X(22) VALUE "POLYTECHNIC UNIVERSITY".
           02 FILLER PIC X(19) VALUE " OF THE PHILIPPINES".
       01  HEADER2.
           02 FILLER PIC X(49) VALUE SPACES.
           02 FILLER PIC X(20) VALUE "COLLEGE OF COMPUTER".
           02 FILLER PIC X(25) VALUE "AND INFORMATION SCIENCE". 
       01  HEADER3.
           02 FILLER PIC X(61) VALUE SPACES.
           02 FILLER PIC X(25) VALUE "STUDENT GRADING SYSTEM".

       01  C-HEADERS-ROW1.
           02 FILLER PIC X(5)  VALUE SPACES.
           02 FILLER PIC X(15) VALUE "YEAR LEVEL".
           02 FILLER PIC X(5)  VALUE SPACES.
           02 FILLER PIC X(15) VALUE "NO. OF".
           02 FILLER PIC X(5)  VALUE SPACES.
           02 FILLER PIC X(15) VALUE "PRELIM".
           02 FILLER PIC X(5)  VALUE SPACES.
           02 FILLER PIC X(15) VALUE "MIDTERM".
           02 FILLER PIC X(5)  VALUE SPACES.
           02 FILLER PIC X(15) VALUE "FINAL".
           02 FILLER PIC X(5)  VALUE SPACES.
           02 FILLER PIC X(15) VALUE "AVERAGE".
           02 FILLER PIC X(5)  VALUE SPACES.
           02 FILLER PIC X(10) VALUE "PASSED".
           02 FILLER PIC X(5)  VALUE SPACES.
           02 FILLER PIC X(10) VALUE "FAILED".

       01  C-HEADERS-ROW2.
           02 FILLER PIC X(25)  VALUE SPACES.
           02 FILLER PIC X(15) VALUE "STUDENTS".
           02 FILLER PIC X(5)  VALUE SPACES.
           02 FILLER PIC X(15) VALUE "GRADE".
           02 FILLER PIC X(5)  VALUE SPACES.
           02 FILLER PIC X(15) VALUE "GRADE".
           02 FILLER PIC X(5)  VALUE SPACES.
           02 FILLER PIC X(15) VALUE "GRADE".
           02 FILLER PIC X(5)  VALUE SPACES.
           02 FILLER PIC X(15) VALUE "GRADE".
           02 FILLER PIC X(5)  VALUE SPACES.
           02 FILLER PIC X(10) VALUE SPACES.
           02 FILLER PIC X(5)  VALUE SPACES.
           02 FILLER PIC X(10) VALUE SPACES.

       01 DISPLAY-DETAILS.
           02 FILLER PIC X(5) VALUE SPACES.
           02 YEAR-LEVEL-OUT     PIC X(15).
           02 FILLER PIC X(5)  VALUE SPACES.
           02 NO-OF-STUDENTS-OUT PIC Z(3).
           02 FILLER PIC X(5)  VALUE SPACES.
           02 PRELIM-GRADE-OUT   PIC Z99.99.
           02 FILLER PIC X(5)  VALUE SPACES.
           02 MIDTERM-GRADE-OUT  PIC Z99.99.
           02 FILLER PIC X(5)  VALUE SPACES.
           02 FINAL-GRADE-OUT    PIC Z99.99.
           02 FILLER PIC X(5)  VALUE SPACES.
           02 AVERAGE-GRADE-OUT  PIC Z99.99.
           02 FILLER PIC X(5)  VALUE SPACES.
           02 PASSED-OUT         PIC Z(3).
           02 FILLER PIC X(5)  VALUE SPACES.
           02 FAILED-OUT         PIC Z(3).

       01  TOTAL-LINE.
           02 FILLER           PIC X(2)  VALUE SPACES.
           02 FILLER           PIC X(12) VALUE "TOTAL".
           02 FILLER           PIC X(3)  VALUE SPACES.
           02 TOT-STUDENTS     PIC ZZZ.
           02 FILLER           PIC X(55) VALUE SPACES.
           02 TOT-PASSED       PIC ZZZ.
           02 FILLER           PIC X(9)  VALUE SPACES.
           02 TOT-FAILED       PIC ZZZ.

       01 INPUT-DETAILS.
           02 FILLER PIC X(5) VALUE SPACES.
           02 YEAR-LEVEL-IN      PIC X(15).
           02 FILLER PIC X(5)  VALUE SPACES.
           02 NO-OF-STUDENTS-IN  PIC 9(3).
           02 FILLER PIC X(5)  VALUE SPACES.
           02 PRELIM-GRADE-IN    PIC 999.99.
           02 FILLER PIC X(5)  VALUE SPACES.
           02 MIDTERM-GRADE-IN   PIC 999.99.
           02 FILLER PIC X(5)  VALUE SPACES.
           02 FINAL-GRADE-IN     PIC 999.99.
           02 FILLER PIC X(5)  VALUE SPACES.
           02 AVERAGE-GRADE-IN   PIC 999.99.
           02 FILLER PIC X(5)  VALUE SPACES.
           02 PASSED-IN          PIC 9(3).
           02 FILLER PIC X(5)  VALUE SPACES.
           02 FAILED-IN          PIC 9(3).

       PROCEDURE DIVISION.
           OPEN OUTPUT GSYSTEM-OUT.
           
           WRITE PRINT-REC FROM HEADER1.
           WRITE PRINT-REC FROM HEADER2.
           WRITE PRINT-REC FROM HEADER3.
           
           MOVE SPACES TO PRINT-REC.
           WRITE PRINT-REC.
           
           WRITE PRINT-REC FROM C-HEADERS-ROW1 AFTER 1 LINE.
           WRITE PRINT-REC FROM C-HEADERS-ROW2 AFTER 1 LINE.

           MOVE ALL "-" TO PRINT-REC(6:150)
           WRITE PRINT-REC AFTER 1 LINE.
           
           CLOSE GSYSTEM-OUT.
           STOP RUN.
