       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG1.
       
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
           SELECT EMP-PAYROLL ASSIGN TO EMP-PAY.DAT
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT EMP-REPORT ASSIGN TO EMP-REP.DAT
               ORGANIZATION IS LINE SEQUENTIAL.
           
       DATA DIVISION.
       FILE SECTION.
       FD EMP-PAYROLL
              LABEL RECORDS ARE STANDARD
       
       FD EMP-REPORT
              LABEL RECORDS ARE STANDARD
       01  EMP-REP-REC    PIC X(100).

       WORKING-STORAGE SECTION.
       